konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_qspi.inc
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> xip_ss_n_0
#               0x02 -> uart1_rts
#               0x03 -> i2c1_scl
#               0x05 -> siob_proc_59
#               0x0b -> uart1_rx
#               0x1f -> null
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_MSB, 4
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_LSB, 0
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_XIP_SS_N_0, 0x00
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_UART1_RTS, 0x02
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_SIOB_PROC_59, 0x05
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_UART1_RX, 0x0b
.equ	IO_QSPI_GPIO_QSPI_SS_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD0_STATUS
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OFFSET, 0x00000020
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_BITS, 0x04022200
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_MSB, 26
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_MSB, 9
.equ	IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD0_CTRL
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OFFSET, 0x00000024
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_BITS, 0x3003f01f
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_MSB, 29
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_LSB, 28
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_BITS, 0x00030000
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_LSB, 16
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_MSB, 15
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_LSB, 14
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_LSB, 12
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> xip_sd0
#               0x02 -> uart0_tx
#               0x03 -> i2c0_sda
#               0x05 -> siob_proc_60
#               0x1f -> null
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_MSB, 4
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_LSB, 0
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_XIP_SD0, 0x00
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_UART0_TX, 0x02
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_I2C0_SDA, 0x03
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_SIOB_PROC_60, 0x05
.equ	IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD1_STATUS
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OFFSET, 0x00000028
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_BITS, 0x04022200
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_MSB, 26
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_MSB, 9
.equ	IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD1_CTRL
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OFFSET, 0x0000002c
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_BITS, 0x3003f01f
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_MSB, 29
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_LSB, 28
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_BITS, 0x00030000
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_LSB, 16
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_MSB, 15
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_LSB, 14
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_LSB, 12
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> xip_sd1
#               0x02 -> uart0_rx
#               0x03 -> i2c0_scl
#               0x05 -> siob_proc_61
#               0x1f -> null
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_MSB, 4
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_LSB, 0
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_XIP_SD1, 0x00
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_UART0_RX, 0x02
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_I2C0_SCL, 0x03
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_SIOB_PROC_61, 0x05
.equ	IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD2_STATUS
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OFFSET, 0x00000030
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_BITS, 0x04022200
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_MSB, 26
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_MSB, 9
.equ	IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD2_CTRL
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OFFSET, 0x00000034
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_BITS, 0x3003f01f
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_MSB, 29
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_LSB, 28
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_BITS, 0x00030000
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_LSB, 16
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_MSB, 15
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_LSB, 14
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_LSB, 12
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> xip_sd2
#               0x02 -> uart0_cts
#               0x03 -> i2c1_sda
#               0x05 -> siob_proc_62
#               0x0b -> uart0_tx
#               0x1f -> null
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_MSB, 4
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_LSB, 0
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_XIP_SD2, 0x00
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_UART0_CTS, 0x02
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_I2C1_SDA, 0x03
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_SIOB_PROC_62, 0x05
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_UART0_TX, 0x0b
.equ	IO_QSPI_GPIO_QSPI_SD2_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD3_STATUS
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OFFSET, 0x00000038
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_BITS, 0x04022200
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC
# Description : interrupt to processors, after override is applied
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_BITS, 0x04000000
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_MSB, 26
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_IRQTOPROC_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD
# Description : input signal from pad, before filtering and override are
#               applied
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_BITS, 0x00020000
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_INFROMPAD_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD
# Description : output enable to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_BITS, 0x00002000
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OETOPAD_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD
# Description : output signal to pad after register override is applied
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_BITS, 0x00000200
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_MSB, 9
.equ	IO_QSPI_GPIO_QSPI_SD3_STATUS_OUTTOPAD_LSB, 9
# =============================================================================
# Register    : IO_QSPI_GPIO_QSPI_SD3_CTRL
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OFFSET, 0x0000003c
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_BITS, 0x3003f01f
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_RESET, 0x0000001f
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER
#               0x0 -> don't invert the interrupt
#               0x1 -> invert the interrupt
#               0x2 -> drive interrupt low
#               0x3 -> drive interrupt high
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_BITS, 0x30000000
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_MSB, 29
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_LSB, 28
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_IRQOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER
#               0x0 -> don't invert the peri input
#               0x1 -> invert the peri input
#               0x2 -> drive peri input low
#               0x3 -> drive peri input high
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_BITS, 0x00030000
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_MSB, 17
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_LSB, 16
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_INOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER
#               0x0 -> drive output enable from peripheral signal selected by funcsel
