konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_qspi.inc
#               0x1 -> drive output enable from inverse of peripheral signal selected by funcsel
#               0x2 -> disable output
#               0x3 -> enable output
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_BITS, 0x0000c000
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_MSB, 15
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_LSB, 14
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_DISABLE, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OEOVER_VALUE_ENABLE, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER
#               0x0 -> drive output from peripheral signal selected by funcsel
#               0x1 -> drive output from inverse of peripheral signal selected by funcsel
#               0x2 -> drive output low
#               0x3 -> drive output high
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_RESET, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_BITS, 0x00003000
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_MSB, 13
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_LSB, 12
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_NORMAL, 0x0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_INVERT, 0x1
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_LOW, 0x2
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_OUTOVER_VALUE_HIGH, 0x3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL
# Description : 0-31 -> selects pin function according to the gpio table
#               31 == NULL
#               0x00 -> xip_sd3
#               0x02 -> uart0_rts
#               0x03 -> i2c1_scl
#               0x05 -> siob_proc_63
#               0x0b -> uart0_rx
#               0x1f -> null
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_RESET, 0x1f
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_BITS, 0x0000001f
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_MSB, 4
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_LSB, 0
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_XIP_SD3, 0x00
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_UART0_RTS, 0x02
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_I2C1_SCL, 0x03
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_SIOB_PROC_63, 0x05
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_UART0_RX, 0x0b
.equ	IO_QSPI_GPIO_QSPI_SD3_CTRL_FUNCSEL_VALUE_NULL, 0x1f
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_PROC0_SECURE
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_OFFSET, 0x00000200
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_PROC0_SECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_OFFSET, 0x00000204
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_PROC0_NONSECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_PROC1_SECURE
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_OFFSET, 0x00000208
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_PROC1_SECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_OFFSET, 0x0000020c
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_PROC1_NONSECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_OFFSET, 0x00000210
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_SECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_OFFSET, 0x00000214
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_BITS, 0x000000ff
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_BITS, 0x00000080
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_MSB, 7
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD3_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_BITS, 0x00000040
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_MSB, 6
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD2_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_BITS, 0x00000020
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_MSB, 5
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD1_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_BITS, 0x00000010
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_MSB, 4
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SD0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_BITS, 0x00000008
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_MSB, 3
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_BITS, 0x00000004
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_MSB, 2
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_GPIO_QSPI_SCLK_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_BITS, 0x00000002
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_MSB, 1
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DM_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_RESET, 0x0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_BITS, 0x00000001
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_MSB, 0
.equ	IO_QSPI_IRQSUMMARY_DORMANT_WAKE_NONSECURE_USBPHY_DP_LSB, 0
# =============================================================================
# Register    : IO_QSPI_INTR
# Description : Raw Interrupts
.equ	IO_QSPI_INTR_OFFSET, 0x00000218
.equ	IO_QSPI_INTR_BITS, 0xffffffff
.equ	IO_QSPI_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH
.equ	IO_QSPI_INTR_GPIO_QSPI_SD3_EDGE_HIGH_RESET, 0x0
