konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_qspi.inc
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_BITS, 0x20000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_MSB, 29
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_HIGH_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_BITS, 0x10000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_MSB, 28
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD3_LEVEL_LOW_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_BITS, 0x08000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_MSB, 27
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_HIGH_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_BITS, 0x04000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_MSB, 26
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_EDGE_LOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_BITS, 0x02000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_MSB, 25
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_HIGH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_BITS, 0x01000000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_MSB, 24
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD2_LEVEL_LOW_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_BITS, 0x00800000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_MSB, 23
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_HIGH_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_BITS, 0x00400000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_MSB, 22
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_EDGE_LOW_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_BITS, 0x00200000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_MSB, 21
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_HIGH_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_BITS, 0x00100000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_MSB, 20
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD1_LEVEL_LOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_BITS, 0x00080000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_MSB, 19
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_HIGH_LSB, 19
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_BITS, 0x00040000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_MSB, 18
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_EDGE_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_BITS, 0x00020000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_MSB, 17
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_HIGH_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_BITS, 0x00010000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_MSB, 16
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SD0_LEVEL_LOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_BITS, 0x00008000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_MSB, 15
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_HIGH_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_BITS, 0x00004000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_MSB, 14
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_EDGE_LOW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_BITS, 0x00002000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_MSB, 13
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_HIGH_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_BITS, 0x00001000
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_MSB, 12
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SS_LEVEL_LOW_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_BITS, 0x00000800
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_MSB, 11
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_HIGH_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_BITS, 0x00000400
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_MSB, 10
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_EDGE_LOW_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_BITS, 0x00000200
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_MSB, 9
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_HIGH_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_BITS, 0x00000100
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_MSB, 8
.equ	IO_QSPI_PROC0_INTF_GPIO_QSPI_SCLK_LEVEL_LOW_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_HIGH_BITS, 0x00000080
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_HIGH_MSB, 7
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_HIGH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_LOW_BITS, 0x00000040
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_LOW_MSB, 6
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_EDGE_LOW_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_HIGH_BITS, 0x00000020
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_HIGH_MSB, 5
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_HIGH_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_LOW_BITS, 0x00000010
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_LOW_MSB, 4
.equ	IO_QSPI_PROC0_INTF_USBPHY_DM_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_HIGH_BITS, 0x00000008
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_HIGH_MSB, 3
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_LOW
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_LOW_BITS, 0x00000004
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_LOW_MSB, 2
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_HIGH_MSB, 1
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_LOW_BITS, 0x00000001
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_LOW_MSB, 0
.equ	IO_QSPI_PROC0_INTF_USBPHY_DP_LEVEL_LOW_LSB, 0
# =============================================================================
# Register    : IO_QSPI_PROC0_INTS
# Description : Interrupt status after masking & forcing for proc0
.equ	IO_QSPI_PROC0_INTS_OFFSET, 0x00000224
.equ	IO_QSPI_PROC0_INTS_BITS, 0xffffffff
.equ	IO_QSPI_PROC0_INTS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_BITS, 0x80000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_MSB, 31
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_HIGH_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_BITS, 0x40000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_MSB, 30
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_EDGE_LOW_LSB, 30
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_BITS, 0x20000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_MSB, 29
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_HIGH_LSB, 29
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_BITS, 0x10000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_MSB, 28
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD3_LEVEL_LOW_LSB, 28
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_BITS, 0x08000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_MSB, 27
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_HIGH_LSB, 27
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_BITS, 0x04000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_MSB, 26
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_EDGE_LOW_LSB, 26
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_BITS, 0x02000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_MSB, 25
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_HIGH_LSB, 25
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_BITS, 0x01000000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_MSB, 24
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD2_LEVEL_LOW_LSB, 24
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_BITS, 0x00800000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_MSB, 23
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_HIGH_LSB, 23
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_BITS, 0x00400000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_MSB, 22
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_EDGE_LOW_LSB, 22
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_BITS, 0x00200000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_MSB, 21
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_HIGH_LSB, 21
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_BITS, 0x00100000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_MSB, 20
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD1_LEVEL_LOW_LSB, 20
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_BITS, 0x00080000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_MSB, 19
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_HIGH_LSB, 19
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_BITS, 0x00040000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_MSB, 18
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_EDGE_LOW_LSB, 18
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_BITS, 0x00020000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_MSB, 17
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_HIGH_LSB, 17
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_BITS, 0x00010000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_MSB, 16
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SD0_LEVEL_LOW_LSB, 16
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_BITS, 0x00008000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_MSB, 15
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_HIGH_LSB, 15
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_BITS, 0x00004000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_MSB, 14
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_EDGE_LOW_LSB, 14
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_BITS, 0x00002000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_MSB, 13
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_HIGH_LSB, 13
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_BITS, 0x00001000
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_MSB, 12
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SS_LEVEL_LOW_LSB, 12
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_BITS, 0x00000800
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_MSB, 11
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_HIGH_LSB, 11
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_BITS, 0x00000400
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_MSB, 10
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_EDGE_LOW_LSB, 10
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_BITS, 0x00000200
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_MSB, 9
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_HIGH_LSB, 9
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_BITS, 0x00000100
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_MSB, 8
.equ	IO_QSPI_PROC0_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_HIGH_BITS, 0x00000080
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_HIGH_MSB, 7
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_HIGH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_LOW_BITS, 0x00000040
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_LOW_MSB, 6
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_EDGE_LOW_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_HIGH_BITS, 0x00000020
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_HIGH_MSB, 5
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_HIGH_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_LOW_BITS, 0x00000010
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_LOW_MSB, 4
.equ	IO_QSPI_PROC0_INTS_USBPHY_DM_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_HIGH
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_HIGH_BITS, 0x00000008
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_HIGH_MSB, 3
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_LOW
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_LOW_BITS, 0x00000004
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_LOW_MSB, 2
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_HIGH
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_HIGH_MSB, 1
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_LOW
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_LOW_BITS, 0x00000001
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_LOW_MSB, 0
.equ	IO_QSPI_PROC0_INTS_USBPHY_DP_LEVEL_LOW_LSB, 0
# =============================================================================
# Register    : IO_QSPI_PROC1_INTE
# Description : Interrupt Enable for proc1
.equ	IO_QSPI_PROC1_INTE_OFFSET, 0x00000228
.equ	IO_QSPI_PROC1_INTE_BITS, 0xffffffff
.equ	IO_QSPI_PROC1_INTE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_BITS, 0x80000000
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_MSB, 31
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_HIGH_LSB, 31
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_LOW
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_PROC1_INTE_GPIO_QSPI_SD3_EDGE_LOW_BITS, 0x40000000
