konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/io_qspi.inc
.equ	IO_QSPI_DORMANT_WAKE_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_BITS, 0x00000100
.equ	IO_QSPI_DORMANT_WAKE_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_MSB, 8
.equ	IO_QSPI_DORMANT_WAKE_INTS_GPIO_QSPI_SCLK_LEVEL_LOW_LSB, 8
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_HIGH
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_HIGH_BITS, 0x00000080
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_HIGH_MSB, 7
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_HIGH_LSB, 7
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_LOW
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_LOW_BITS, 0x00000040
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_LOW_MSB, 6
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_EDGE_LOW_LSB, 6
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_HIGH
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_HIGH_BITS, 0x00000020
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_HIGH_MSB, 5
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_HIGH_LSB, 5
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_LOW
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_LOW_BITS, 0x00000010
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_LOW_MSB, 4
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DM_LEVEL_LOW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_HIGH
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_HIGH_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_HIGH_BITS, 0x00000008
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_HIGH_MSB, 3
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_HIGH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_LOW
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_LOW_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_LOW_BITS, 0x00000004
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_LOW_MSB, 2
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_EDGE_LOW_LSB, 2
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_HIGH
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_HIGH_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_HIGH_BITS, 0x00000002
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_HIGH_MSB, 1
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_HIGH_LSB, 1
# -----------------------------------------------------------------------------
# Field       : IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_LOW
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_LOW_RESET, 0x0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_LOW_BITS, 0x00000001
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_LOW_MSB, 0
.equ	IO_QSPI_DORMANT_WAKE_INTS_USBPHY_DP_LEVEL_LOW_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_IO_QSPI_H
